# python数据分为可变类型和不可变类型
# 不可变：字符串、数字、元组   修改其值，内存地址会发生变化
# 可变：列表、字典、集合       修改其值，内存地址不会发生变化
# 使用内置函数id()可以获取到变量的内存地址

# str1指向了"a"
str1 = "a"
# str2指向了"a"
str2 = str1
# str1指向了"b"
str1 = "b"
# 1596392969752
print(id(str1))
# 1596392971432
print(id(str2))
# str2还是指向"a"
print(str2)


# list1指向了 ["韩信", "李白"]
list1 = ["韩信", "李白"]
# list2指向了 ["韩信", "李白"]
list2 = list1
# ["韩信", "李白"]修改为 ['张飞', '李白']
list1[0] = "张飞"
# list2指向的地方变成了 ['张飞', '李白']
print(list2)
# list1 指向了 ["孙悟空"]
list1 = ["孙悟空"]
# ['张飞', '李白']  list2无变化
print(list2)


# 复制---copy方法
x = [100, 200]
# 这个y和x没有任何关系了
y = x.copy()
x[0] = 300
# [300, 200]
print(x)
# [100, 200]
print(y)

# 复制---copy模块
import copy
z = copy.copy(x)

# 复制---切片
m = x[::]
x[0] = 400
# [300, 200]
print(m)